grevaillot/svd_tools/headers/STM32L4x6/can1.h
#define CAN1_RI1R_EXID_SHIFT		3
#define CAN1_RI1R_EXID_MASK		0x3ffff
/** @defgroup can1_ri1r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_RI1R_IDE IDE **/
#define CAN1_RI1R_IDE		(1 << 2)
/** CAN1_RI1R_RTR RTR **/
#define CAN1_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can1_rdt1r RDT1R mailbox data high register
@{*/


#define CAN1_RDT1R_TIME_SHIFT		16
#define CAN1_RDT1R_TIME_MASK		0xffff
/** @defgroup can1_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN1_RDT1R_FMI_SHIFT		8
#define CAN1_RDT1R_FMI_MASK		0xff
/** @defgroup can1_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN1_RDT1R_DLC_SHIFT		0
#define CAN1_RDT1R_DLC_MASK		0x0f
/** @defgroup can1_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rdl1r RDL1R mailbox data high register
@{*/


#define CAN1_RDL1R_DATA3_SHIFT		24
#define CAN1_RDL1R_DATA3_MASK		0xff
/** @defgroup can1_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_RDL1R_DATA2_SHIFT		16
#define CAN1_RDL1R_DATA2_MASK		0xff
/** @defgroup can1_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_RDL1R_DATA1_SHIFT		8
#define CAN1_RDL1R_DATA1_MASK		0xff
/** @defgroup can1_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_RDL1R_DATA0_SHIFT		0
#define CAN1_RDL1R_DATA0_MASK		0xff
/** @defgroup can1_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rdh1r RDH1R mailbox data high register
@{*/


#define CAN1_RDH1R_DATA7_SHIFT		24
#define CAN1_RDH1R_DATA7_MASK		0xff
/** @defgroup can1_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_RDH1R_DATA6_SHIFT		16
#define CAN1_RDH1R_DATA6_MASK		0xff
/** @defgroup can1_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_RDH1R_DATA5_SHIFT		8
#define CAN1_RDH1R_DATA5_MASK		0xff
/** @defgroup can1_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_RDH1R_DATA4_SHIFT		0
#define CAN1_RDH1R_DATA4_MASK		0xff
/** @defgroup can1_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_fmr FMR filter master register
@{*/


#define CAN1_FMR_CANSB_SHIFT		8
#define CAN1_FMR_CANSB_MASK		0x3f
/** @defgroup can1_fmr_cansb CANSB CAN start bank
@{*/
/**@}*/

/** CAN1_FMR_FINIT Filter initialization mode **/
#define CAN1_FMR_FINIT		(1 << 0)

/**@}*/

/** @defgroup can1_fm1r FM1R filter mode register
@{*/

/** CAN1_FM1R_FBM27 Filter mode **/
#define CAN1_FM1R_FBM27		(1 << 27)
/** CAN1_FM1R_FBM26 Filter mode **/
#define CAN1_FM1R_FBM26		(1 << 26)
/** CAN1_FM1R_FBM25 Filter mode **/
#define CAN1_FM1R_FBM25		(1 << 25)
/** CAN1_FM1R_FBM24 Filter mode **/
#define CAN1_FM1R_FBM24		(1 << 24)
/** CAN1_FM1R_FBM23 Filter mode **/
#define CAN1_FM1R_FBM23		(1 << 23)
/** CAN1_FM1R_FBM22 Filter mode **/
#define CAN1_FM1R_FBM22		(1 << 22)
/** CAN1_FM1R_FBM21 Filter mode **/
#define CAN1_FM1R_FBM21		(1 << 21)
/** CAN1_FM1R_FBM20 Filter mode **/
#define CAN1_FM1R_FBM20		(1 << 20)
/** CAN1_FM1R_FBM19 Filter mode **/
#define CAN1_FM1R_FBM19		(1 << 19)
/** CAN1_FM1R_FBM18 Filter mode **/
#define CAN1_FM1R_FBM18		(1 << 18)
/** CAN1_FM1R_FBM17 Filter mode **/
#define CAN1_FM1R_FBM17		(1 << 17)
/** CAN1_FM1R_FBM16 Filter mode **/
#define CAN1_FM1R_FBM16		(1 << 16)
/** CAN1_FM1R_FBM15 Filter mode **/
#define CAN1_FM1R_FBM15		(1 << 15)
/** CAN1_FM1R_FBM14 Filter mode **/
#define CAN1_FM1R_FBM14		(1 << 14)
/** CAN1_FM1R_FBM13 Filter mode **/
#define CAN1_FM1R_FBM13		(1 << 13)
/** CAN1_FM1R_FBM12 Filter mode **/
#define CAN1_FM1R_FBM12		(1 << 12)
/** CAN1_FM1R_FBM11 Filter mode **/
#define CAN1_FM1R_FBM11		(1 << 11)
/** CAN1_FM1R_FBM10 Filter mode **/
#define CAN1_FM1R_FBM10		(1 << 10)
/** CAN1_FM1R_FBM9 Filter mode **/
#define CAN1_FM1R_FBM9		(1 << 9)
/** CAN1_FM1R_FBM8 Filter mode **/
#define CAN1_FM1R_FBM8		(1 << 8)
/** CAN1_FM1R_FBM7 Filter mode **/
#define CAN1_FM1R_FBM7		(1 << 7)
/** CAN1_FM1R_FBM6 Filter mode **/
#define CAN1_FM1R_FBM6		(1 << 6)
/** CAN1_FM1R_FBM5 Filter mode **/
#define CAN1_FM1R_FBM5		(1 << 5)
/** CAN1_FM1R_FBM4 Filter mode **/
#define CAN1_FM1R_FBM4		(1 << 4)
/** CAN1_FM1R_FBM3 Filter mode **/
#define CAN1_FM1R_FBM3		(1 << 3)
/** CAN1_FM1R_FBM2 Filter mode **/
#define CAN1_FM1R_FBM2		(1 << 2)
/** CAN1_FM1R_FBM1 Filter mode **/
#define CAN1_FM1R_FBM1		(1 << 1)
/** CAN1_FM1R_FBM0 Filter mode **/
#define CAN1_FM1R_FBM0		(1 << 0)

/**@}*/

/** @defgroup can1_fs1r FS1R filter scale register
@{*/

/** CAN1_FS1R_FSC27 Filter scale configuration **/
#define CAN1_FS1R_FSC27		(1 << 27)
/** CAN1_FS1R_FSC26 Filter scale configuration **/
#define CAN1_FS1R_FSC26		(1 << 26)
/** CAN1_FS1R_FSC25 Filter scale configuration **/
#define CAN1_FS1R_FSC25		(1 << 25)
/** CAN1_FS1R_FSC24 Filter scale configuration **/
#define CAN1_FS1R_FSC24		(1 << 24)
/** CAN1_FS1R_FSC23 Filter scale configuration **/
#define CAN1_FS1R_FSC23		(1 << 23)
/** CAN1_FS1R_FSC22 Filter scale configuration **/
#define CAN1_FS1R_FSC22		(1 << 22)
/** CAN1_FS1R_FSC21 Filter scale configuration **/
#define CAN1_FS1R_FSC21		(1 << 21)
/** CAN1_FS1R_FSC20 Filter scale configuration **/
#define CAN1_FS1R_FSC20		(1 << 20)
/** CAN1_FS1R_FSC19 Filter scale configuration **/
#define CAN1_FS1R_FSC19		(1 << 19)
/** CAN1_FS1R_FSC18 Filter scale configuration **/
#define CAN1_FS1R_FSC18		(1 << 18)
/** CAN1_FS1R_FSC17 Filter scale configuration **/
#define CAN1_FS1R_FSC17		(1 << 17)
/** CAN1_FS1R_FSC16 Filter scale configuration **/
#define CAN1_FS1R_FSC16		(1 << 16)
/** CAN1_FS1R_FSC15 Filter scale configuration **/
#define CAN1_FS1R_FSC15		(1 << 15)
/** CAN1_FS1R_FSC14 Filter scale configuration **/
#define CAN1_FS1R_FSC14		(1 << 14)
/** CAN1_FS1R_FSC13 Filter scale configuration **/
#define CAN1_FS1R_FSC13		(1 << 13)
/** CAN1_FS1R_FSC12 Filter scale configuration **/
#define CAN1_FS1R_FSC12		(1 << 12)
/** CAN1_FS1R_FSC11 Filter scale configuration **/
#define CAN1_FS1R_FSC11		(1 << 11)
/** CAN1_FS1R_FSC10 Filter scale configuration **/
#define CAN1_FS1R_FSC10		(1 << 10)
/** CAN1_FS1R_FSC9 Filter scale configuration **/
#define CAN1_FS1R_FSC9		(1 << 9)
/** CAN1_FS1R_FSC8 Filter scale configuration **/
#define CAN1_FS1R_FSC8		(1 << 8)
/** CAN1_FS1R_FSC7 Filter scale configuration **/
#define CAN1_FS1R_FSC7		(1 << 7)
/** CAN1_FS1R_FSC6 Filter scale configuration **/
#define CAN1_FS1R_FSC6		(1 << 6)
/** CAN1_FS1R_FSC5 Filter scale configuration **/
#define CAN1_FS1R_FSC5		(1 << 5)
/** CAN1_FS1R_FSC4 Filter scale configuration **/
#define CAN1_FS1R_FSC4		(1 << 4)
/** CAN1_FS1R_FSC3 Filter scale configuration **/
#define CAN1_FS1R_FSC3		(1 << 3)
/** CAN1_FS1R_FSC2 Filter scale configuration **/
#define CAN1_FS1R_FSC2		(1 << 2)
/** CAN1_FS1R_FSC1 Filter scale configuration **/
#define CAN1_FS1R_FSC1		(1 << 1)
/** CAN1_FS1R_FSC0 Filter scale configuration **/
#define CAN1_FS1R_FSC0		(1 << 0)

/**@}*/

/** @defgroup can1_ffa1r FFA1R filter FIFO assignment register
@{*/

/** CAN1_FFA1R_FFA27 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA27		(1 << 27)
/** CAN1_FFA1R_FFA26 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA26		(1 << 26)
/** CAN1_FFA1R_FFA25 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA25		(1 << 25)
/** CAN1_FFA1R_FFA24 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA24		(1 << 24)
/** CAN1_FFA1R_FFA23 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA23		(1 << 23)
/** CAN1_FFA1R_FFA22 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA22		(1 << 22)
/** CAN1_FFA1R_FFA21 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA21		(1 << 21)
/** CAN1_FFA1R_FFA20 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA20		(1 << 20)
/** CAN1_FFA1R_FFA19 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA19		(1 << 19)
/** CAN1_FFA1R_FFA18 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA18		(1 << 18)
/** CAN1_FFA1R_FFA17 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA17		(1 << 17)
/** CAN1_FFA1R_FFA16 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA16		(1 << 16)
/** CAN1_FFA1R_FFA15 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA15		(1 << 15)
/** CAN1_FFA1R_FFA14 Filter FIFO assignment for filter **/
#define CAN1_FFA1R_FFA14		(1 << 14)
/** CAN1_FFA1R_FFA13 Filter FIFO assignment for filter 13 **/
#define CAN1_FFA1R_FFA13		(1 << 13)
/** CAN1_FFA1R_FFA12 Filter FIFO assignment for filter 12 **/
#define CAN1_FFA1R_FFA12		(1 << 12)
/** CAN1_FFA1R_FFA11 Filter FIFO assignment for filter 11 **/
#define CAN1_FFA1R_FFA11		(1 << 11)
/** CAN1_FFA1R_FFA10 Filter FIFO assignment for filter 10 **/
#define CAN1_FFA1R_FFA10		(1 << 10)
/** CAN1_FFA1R_FFA9 Filter FIFO assignment for filter 9 **/
#define CAN1_FFA1R_FFA9		(1 << 9)
/** CAN1_FFA1R_FFA8 Filter FIFO assignment for filter 8 **/
#define CAN1_FFA1R_FFA8		(1 << 8)
/** CAN1_FFA1R_FFA7 Filter FIFO assignment for filter 7 **/
#define CAN1_FFA1R_FFA7		(1 << 7)
/** CAN1_FFA1R_FFA6 Filter FIFO assignment for filter 6 **/
#define CAN1_FFA1R_FFA6		(1 << 6)
/** CAN1_FFA1R_FFA5 Filter FIFO assignment for filter 5 **/
#define CAN1_FFA1R_FFA5		(1 << 5)
/** CAN1_FFA1R_FFA4 Filter FIFO assignment for filter 4 **/
#define CAN1_FFA1R_FFA4		(1 << 4)
/** CAN1_FFA1R_FFA3 Filter FIFO assignment for filter 3 **/
#define CAN1_FFA1R_FFA3		(1 << 3)
/** CAN1_FFA1R_FFA2 Filter FIFO assignment for filter 2 **/
#define CAN1_FFA1R_FFA2		(1 << 2)
/** CAN1_FFA1R_FFA1 Filter FIFO assignment for filter 1 **/
#define CAN1_FFA1R_FFA1		(1 << 1)
/** CAN1_FFA1R_FFA0 Filter FIFO assignment for filter 0 **/
#define CAN1_FFA1R_FFA0		(1 << 0)

/**@}*/

