grevaillot/svd_tools/headers/STM32L4x6/can1.h
/** @defgroup can1_fa1r FA1R filter activation register
@{*/

/** CAN1_FA1R_FACT27 Filter active **/
#define CAN1_FA1R_FACT27		(1 << 27)
/** CAN1_FA1R_FACT26 Filter active **/
#define CAN1_FA1R_FACT26		(1 << 26)
/** CAN1_FA1R_FACT25 Filter active **/
#define CAN1_FA1R_FACT25		(1 << 25)
/** CAN1_FA1R_FACT24 Filter active **/
#define CAN1_FA1R_FACT24		(1 << 24)
/** CAN1_FA1R_FACT23 Filter active **/
#define CAN1_FA1R_FACT23		(1 << 23)
/** CAN1_FA1R_FACT22 Filter active **/
#define CAN1_FA1R_FACT22		(1 << 22)
/** CAN1_FA1R_FACT21 Filter active **/
#define CAN1_FA1R_FACT21		(1 << 21)
/** CAN1_FA1R_FACT20 Filter active **/
#define CAN1_FA1R_FACT20		(1 << 20)
/** CAN1_FA1R_FACT19 Filter active **/
#define CAN1_FA1R_FACT19		(1 << 19)
/** CAN1_FA1R_FACT18 Filter active **/
#define CAN1_FA1R_FACT18		(1 << 18)
/** CAN1_FA1R_FACT17 Filter active **/
#define CAN1_FA1R_FACT17		(1 << 17)
/** CAN1_FA1R_FACT16 Filter active **/
#define CAN1_FA1R_FACT16		(1 << 16)
/** CAN1_FA1R_FACT15 Filter active **/
#define CAN1_FA1R_FACT15		(1 << 15)
/** CAN1_FA1R_FACT14 Filter active **/
#define CAN1_FA1R_FACT14		(1 << 14)
/** CAN1_FA1R_FACT13 Filter active **/
#define CAN1_FA1R_FACT13		(1 << 13)
/** CAN1_FA1R_FACT12 Filter active **/
#define CAN1_FA1R_FACT12		(1 << 12)
/** CAN1_FA1R_FACT11 Filter active **/
#define CAN1_FA1R_FACT11		(1 << 11)
/** CAN1_FA1R_FACT10 Filter active **/
#define CAN1_FA1R_FACT10		(1 << 10)
/** CAN1_FA1R_FACT9 Filter active **/
#define CAN1_FA1R_FACT9		(1 << 9)
/** CAN1_FA1R_FACT8 Filter active **/
#define CAN1_FA1R_FACT8		(1 << 8)
/** CAN1_FA1R_FACT7 Filter active **/
#define CAN1_FA1R_FACT7		(1 << 7)
/** CAN1_FA1R_FACT6 Filter active **/
#define CAN1_FA1R_FACT6		(1 << 6)
/** CAN1_FA1R_FACT5 Filter active **/
#define CAN1_FA1R_FACT5		(1 << 5)
/** CAN1_FA1R_FACT4 Filter active **/
#define CAN1_FA1R_FACT4		(1 << 4)
/** CAN1_FA1R_FACT3 Filter active **/
#define CAN1_FA1R_FACT3		(1 << 3)
/** CAN1_FA1R_FACT2 Filter active **/
#define CAN1_FA1R_FACT2		(1 << 2)
/** CAN1_FA1R_FACT1 Filter active **/
#define CAN1_FA1R_FACT1		(1 << 1)
/** CAN1_FA1R_FACT0 Filter active **/
#define CAN1_FA1R_FACT0		(1 << 0)

/**@}*/

/** @defgroup can1_f0r1 F0R1 Filter bank 0 register 1
@{*/

/** CAN1_F0R1_FB31 Filter bits **/
#define CAN1_F0R1_FB31		(1 << 31)
/** CAN1_F0R1_FB30 Filter bits **/
#define CAN1_F0R1_FB30		(1 << 30)
/** CAN1_F0R1_FB29 Filter bits **/
#define CAN1_F0R1_FB29		(1 << 29)
/** CAN1_F0R1_FB28 Filter bits **/
#define CAN1_F0R1_FB28		(1 << 28)
/** CAN1_F0R1_FB27 Filter bits **/
#define CAN1_F0R1_FB27		(1 << 27)
/** CAN1_F0R1_FB26 Filter bits **/
#define CAN1_F0R1_FB26		(1 << 26)
/** CAN1_F0R1_FB25 Filter bits **/
#define CAN1_F0R1_FB25		(1 << 25)
/** CAN1_F0R1_FB24 Filter bits **/
#define CAN1_F0R1_FB24		(1 << 24)
/** CAN1_F0R1_FB23 Filter bits **/
#define CAN1_F0R1_FB23		(1 << 23)
/** CAN1_F0R1_FB22 Filter bits **/
#define CAN1_F0R1_FB22		(1 << 22)
/** CAN1_F0R1_FB21 Filter bits **/
#define CAN1_F0R1_FB21		(1 << 21)
/** CAN1_F0R1_FB20 Filter bits **/
#define CAN1_F0R1_FB20		(1 << 20)
/** CAN1_F0R1_FB19 Filter bits **/
#define CAN1_F0R1_FB19		(1 << 19)
/** CAN1_F0R1_FB18 Filter bits **/
#define CAN1_F0R1_FB18		(1 << 18)
/** CAN1_F0R1_FB17 Filter bits **/
#define CAN1_F0R1_FB17		(1 << 17)
/** CAN1_F0R1_FB16 Filter bits **/
#define CAN1_F0R1_FB16		(1 << 16)
/** CAN1_F0R1_FB15 Filter bits **/
#define CAN1_F0R1_FB15		(1 << 15)
/** CAN1_F0R1_FB14 Filter bits **/
#define CAN1_F0R1_FB14		(1 << 14)
/** CAN1_F0R1_FB13 Filter bits **/
#define CAN1_F0R1_FB13		(1 << 13)
/** CAN1_F0R1_FB12 Filter bits **/
#define CAN1_F0R1_FB12		(1 << 12)
/** CAN1_F0R1_FB11 Filter bits **/
#define CAN1_F0R1_FB11		(1 << 11)
/** CAN1_F0R1_FB10 Filter bits **/
#define CAN1_F0R1_FB10		(1 << 10)
/** CAN1_F0R1_FB9 Filter bits **/
#define CAN1_F0R1_FB9		(1 << 9)
/** CAN1_F0R1_FB8 Filter bits **/
#define CAN1_F0R1_FB8		(1 << 8)
/** CAN1_F0R1_FB7 Filter bits **/
#define CAN1_F0R1_FB7		(1 << 7)
/** CAN1_F0R1_FB6 Filter bits **/
#define CAN1_F0R1_FB6		(1 << 6)
/** CAN1_F0R1_FB5 Filter bits **/
#define CAN1_F0R1_FB5		(1 << 5)
/** CAN1_F0R1_FB4 Filter bits **/
#define CAN1_F0R1_FB4		(1 << 4)
/** CAN1_F0R1_FB3 Filter bits **/
#define CAN1_F0R1_FB3		(1 << 3)
/** CAN1_F0R1_FB2 Filter bits **/
#define CAN1_F0R1_FB2		(1 << 2)
/** CAN1_F0R1_FB1 Filter bits **/
#define CAN1_F0R1_FB1		(1 << 1)
/** CAN1_F0R1_FB0 Filter bits **/
#define CAN1_F0R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f0r2 F0R2 Filter bank 0 register 2
@{*/

/** CAN1_F0R2_FB31 Filter bits **/
#define CAN1_F0R2_FB31		(1 << 31)
/** CAN1_F0R2_FB30 Filter bits **/
#define CAN1_F0R2_FB30		(1 << 30)
/** CAN1_F0R2_FB29 Filter bits **/
#define CAN1_F0R2_FB29		(1 << 29)
/** CAN1_F0R2_FB28 Filter bits **/
#define CAN1_F0R2_FB28		(1 << 28)
/** CAN1_F0R2_FB27 Filter bits **/
#define CAN1_F0R2_FB27		(1 << 27)
/** CAN1_F0R2_FB26 Filter bits **/
#define CAN1_F0R2_FB26		(1 << 26)
/** CAN1_F0R2_FB25 Filter bits **/
#define CAN1_F0R2_FB25		(1 << 25)
/** CAN1_F0R2_FB24 Filter bits **/
#define CAN1_F0R2_FB24		(1 << 24)
/** CAN1_F0R2_FB23 Filter bits **/
#define CAN1_F0R2_FB23		(1 << 23)
/** CAN1_F0R2_FB22 Filter bits **/
#define CAN1_F0R2_FB22		(1 << 22)
/** CAN1_F0R2_FB21 Filter bits **/
#define CAN1_F0R2_FB21		(1 << 21)
/** CAN1_F0R2_FB20 Filter bits **/
#define CAN1_F0R2_FB20		(1 << 20)
/** CAN1_F0R2_FB19 Filter bits **/
#define CAN1_F0R2_FB19		(1 << 19)
/** CAN1_F0R2_FB18 Filter bits **/
#define CAN1_F0R2_FB18		(1 << 18)
/** CAN1_F0R2_FB17 Filter bits **/
#define CAN1_F0R2_FB17		(1 << 17)
/** CAN1_F0R2_FB16 Filter bits **/
#define CAN1_F0R2_FB16		(1 << 16)
/** CAN1_F0R2_FB15 Filter bits **/
#define CAN1_F0R2_FB15		(1 << 15)
/** CAN1_F0R2_FB14 Filter bits **/
#define CAN1_F0R2_FB14		(1 << 14)
/** CAN1_F0R2_FB13 Filter bits **/
#define CAN1_F0R2_FB13		(1 << 13)
/** CAN1_F0R2_FB12 Filter bits **/
#define CAN1_F0R2_FB12		(1 << 12)
/** CAN1_F0R2_FB11 Filter bits **/
#define CAN1_F0R2_FB11		(1 << 11)
/** CAN1_F0R2_FB10 Filter bits **/
#define CAN1_F0R2_FB10		(1 << 10)
/** CAN1_F0R2_FB9 Filter bits **/
#define CAN1_F0R2_FB9		(1 << 9)
/** CAN1_F0R2_FB8 Filter bits **/
#define CAN1_F0R2_FB8		(1 << 8)
/** CAN1_F0R2_FB7 Filter bits **/
#define CAN1_F0R2_FB7		(1 << 7)
/** CAN1_F0R2_FB6 Filter bits **/
#define CAN1_F0R2_FB6		(1 << 6)
/** CAN1_F0R2_FB5 Filter bits **/
#define CAN1_F0R2_FB5		(1 << 5)
/** CAN1_F0R2_FB4 Filter bits **/
#define CAN1_F0R2_FB4		(1 << 4)
/** CAN1_F0R2_FB3 Filter bits **/
#define CAN1_F0R2_FB3		(1 << 3)
/** CAN1_F0R2_FB2 Filter bits **/
#define CAN1_F0R2_FB2		(1 << 2)
/** CAN1_F0R2_FB1 Filter bits **/
#define CAN1_F0R2_FB1		(1 << 1)
/** CAN1_F0R2_FB0 Filter bits **/
#define CAN1_F0R2_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f1r1 F1R1 Filter bank 1 register 1
@{*/

/** CAN1_F1R1_FB31 Filter bits **/
#define CAN1_F1R1_FB31		(1 << 31)
/** CAN1_F1R1_FB30 Filter bits **/
#define CAN1_F1R1_FB30		(1 << 30)
/** CAN1_F1R1_FB29 Filter bits **/
#define CAN1_F1R1_FB29		(1 << 29)
/** CAN1_F1R1_FB28 Filter bits **/
#define CAN1_F1R1_FB28		(1 << 28)
/** CAN1_F1R1_FB27 Filter bits **/
#define CAN1_F1R1_FB27		(1 << 27)
/** CAN1_F1R1_FB26 Filter bits **/
#define CAN1_F1R1_FB26		(1 << 26)
/** CAN1_F1R1_FB25 Filter bits **/
#define CAN1_F1R1_FB25		(1 << 25)
/** CAN1_F1R1_FB24 Filter bits **/
#define CAN1_F1R1_FB24		(1 << 24)
/** CAN1_F1R1_FB23 Filter bits **/
#define CAN1_F1R1_FB23		(1 << 23)
/** CAN1_F1R1_FB22 Filter bits **/
#define CAN1_F1R1_FB22		(1 << 22)
/** CAN1_F1R1_FB21 Filter bits **/
#define CAN1_F1R1_FB21		(1 << 21)
/** CAN1_F1R1_FB20 Filter bits **/
#define CAN1_F1R1_FB20		(1 << 20)
/** CAN1_F1R1_FB19 Filter bits **/
#define CAN1_F1R1_FB19		(1 << 19)
/** CAN1_F1R1_FB18 Filter bits **/
#define CAN1_F1R1_FB18		(1 << 18)
/** CAN1_F1R1_FB17 Filter bits **/
#define CAN1_F1R1_FB17		(1 << 17)
/** CAN1_F1R1_FB16 Filter bits **/
#define CAN1_F1R1_FB16		(1 << 16)
/** CAN1_F1R1_FB15 Filter bits **/
#define CAN1_F1R1_FB15		(1 << 15)
/** CAN1_F1R1_FB14 Filter bits **/
#define CAN1_F1R1_FB14		(1 << 14)
/** CAN1_F1R1_FB13 Filter bits **/
#define CAN1_F1R1_FB13		(1 << 13)
/** CAN1_F1R1_FB12 Filter bits **/
#define CAN1_F1R1_FB12		(1 << 12)
/** CAN1_F1R1_FB11 Filter bits **/
#define CAN1_F1R1_FB11		(1 << 11)
/** CAN1_F1R1_FB10 Filter bits **/
#define CAN1_F1R1_FB10		(1 << 10)
/** CAN1_F1R1_FB9 Filter bits **/
#define CAN1_F1R1_FB9		(1 << 9)
/** CAN1_F1R1_FB8 Filter bits **/
#define CAN1_F1R1_FB8		(1 << 8)
/** CAN1_F1R1_FB7 Filter bits **/
#define CAN1_F1R1_FB7		(1 << 7)
/** CAN1_F1R1_FB6 Filter bits **/
#define CAN1_F1R1_FB6		(1 << 6)
/** CAN1_F1R1_FB5 Filter bits **/
#define CAN1_F1R1_FB5		(1 << 5)
/** CAN1_F1R1_FB4 Filter bits **/
#define CAN1_F1R1_FB4		(1 << 4)
/** CAN1_F1R1_FB3 Filter bits **/
#define CAN1_F1R1_FB3		(1 << 3)
/** CAN1_F1R1_FB2 Filter bits **/
#define CAN1_F1R1_FB2		(1 << 2)
/** CAN1_F1R1_FB1 Filter bits **/
#define CAN1_F1R1_FB1		(1 << 1)
/** CAN1_F1R1_FB0 Filter bits **/
#define CAN1_F1R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f1r2 F1R2 Filter bank 1 register 2
@{*/

/** CAN1_F1R2_FB31 Filter bits **/
#define CAN1_F1R2_FB31		(1 << 31)
/** CAN1_F1R2_FB30 Filter bits **/
#define CAN1_F1R2_FB30		(1 << 30)
/** CAN1_F1R2_FB29 Filter bits **/
#define CAN1_F1R2_FB29		(1 << 29)
/** CAN1_F1R2_FB28 Filter bits **/
#define CAN1_F1R2_FB28		(1 << 28)
/** CAN1_F1R2_FB27 Filter bits **/
#define CAN1_F1R2_FB27		(1 << 27)
/** CAN1_F1R2_FB26 Filter bits **/
#define CAN1_F1R2_FB26		(1 << 26)
/** CAN1_F1R2_FB25 Filter bits **/
#define CAN1_F1R2_FB25		(1 << 25)
/** CAN1_F1R2_FB24 Filter bits **/
#define CAN1_F1R2_FB24		(1 << 24)
/** CAN1_F1R2_FB23 Filter bits **/
#define CAN1_F1R2_FB23		(1 << 23)
/** CAN1_F1R2_FB22 Filter bits **/
#define CAN1_F1R2_FB22		(1 << 22)
/** CAN1_F1R2_FB21 Filter bits **/
#define CAN1_F1R2_FB21		(1 << 21)
/** CAN1_F1R2_FB20 Filter bits **/
#define CAN1_F1R2_FB20		(1 << 20)
/** CAN1_F1R2_FB19 Filter bits **/
#define CAN1_F1R2_FB19		(1 << 19)
/** CAN1_F1R2_FB18 Filter bits **/
#define CAN1_F1R2_FB18		(1 << 18)
/** CAN1_F1R2_FB17 Filter bits **/
#define CAN1_F1R2_FB17		(1 << 17)
/** CAN1_F1R2_FB16 Filter bits **/
#define CAN1_F1R2_FB16		(1 << 16)
/** CAN1_F1R2_FB15 Filter bits **/
#define CAN1_F1R2_FB15		(1 << 15)
/** CAN1_F1R2_FB14 Filter bits **/
#define CAN1_F1R2_FB14		(1 << 14)
/** CAN1_F1R2_FB13 Filter bits **/
#define CAN1_F1R2_FB13		(1 << 13)
/** CAN1_F1R2_FB12 Filter bits **/
#define CAN1_F1R2_FB12		(1 << 12)
/** CAN1_F1R2_FB11 Filter bits **/
#define CAN1_F1R2_FB11		(1 << 11)
/** CAN1_F1R2_FB10 Filter bits **/
#define CAN1_F1R2_FB10		(1 << 10)
/** CAN1_F1R2_FB9 Filter bits **/
#define CAN1_F1R2_FB9		(1 << 9)
/** CAN1_F1R2_FB8 Filter bits **/
#define CAN1_F1R2_FB8		(1 << 8)
/** CAN1_F1R2_FB7 Filter bits **/
#define CAN1_F1R2_FB7		(1 << 7)
/** CAN1_F1R2_FB6 Filter bits **/
#define CAN1_F1R2_FB6		(1 << 6)
/** CAN1_F1R2_FB5 Filter bits **/
#define CAN1_F1R2_FB5		(1 << 5)
/** CAN1_F1R2_FB4 Filter bits **/
#define CAN1_F1R2_FB4		(1 << 4)
/** CAN1_F1R2_FB3 Filter bits **/
#define CAN1_F1R2_FB3		(1 << 3)
/** CAN1_F1R2_FB2 Filter bits **/
#define CAN1_F1R2_FB2		(1 << 2)
/** CAN1_F1R2_FB1 Filter bits **/
#define CAN1_F1R2_FB1		(1 << 1)
/** CAN1_F1R2_FB0 Filter bits **/
#define CAN1_F1R2_FB0		(1 << 0)

/**@}*/

